{
  "content": "\n\n \nHong Phung Phat \nSenior Software Developer \n30 Sep 1992 \n201/1/4 Doi Cung, W.9, D.11 HCMC. \n0764 74 99 64 (Phone/Zalo/WhatsApp) \nhpphat1992@gmail.com \nhttps://www.linkedin.com/in/hpphat1992/ \n \nSummary \nSenior Web Developer specializing in front-end development. Experienced with all stages of the development \ncycle for dynamic web projects in many scopes (social networks, data management, travelling, ...). Well-versed in \nnumerous programming languages including HTML5, JavaScript, CSS. Have strong background in some common \nWeb frameworks and libraries such as AngularJS, Angular, ReactJS... The target is to become a full stack \ndeveloper or a tech-lead.  \n \nExperience \nSenior Software Engineer \nBackbase - R&D AI Team - Hybrid - District 3 - HCM\n \nNov 2024 - Present \n- Collaborate closely with project managers and the AI team to develop and implement AI-powered solutions \nfor the banking sector. \n- Implement ideas and ensure it is following  the release schedule. \nKey achievement: Worked as part of an R&D team in a product-focused company, where the process and \nworkflow emphasized innovation and idea development over traditional delivery timelines. \n \nSenior Software Engineer \nHCL Technologies Limited - Remote - District 1 - HCM\n \nDec 2021 - Nov 2024 \n- Work with a team from a multi-country company to develop a DMS for managing documents of whole \naerospace company using technologies: Angular 11-14, GoJS. \n- Joining meetings in the Agile/Scrum process to understand, report and contribute to the development \nprocess.. \n- Raising some new ideas to improve the current UI/UX of the application. \nKey achievement: Learn a new scope of business in managing the documents. Work with other team members \nfrom other countries with different countries and timezones. \n \nSenior Software Engineer \nSaigon Technology Solution - Hybrid - Tan Binh - HCM\n \nOct 2020 - Dec 2021 \n- Work in a team to develop a wealth management application using Angular, Ruby on Rails, SOLID principles. \n\n- Joining meetings in the Agile/Scrum process. \n- Contribution in the development process. \nKey achievement: Have some contribution in the working process and code quality improvement. \n \nSenior Software Engineer \nNashtech Vietnam - Onsite - Tan Binh - HCM \nDec 2018 - Oct 2020 \n- Joined the team to develop a web application for the wealth management domain of a bank.  \n- Joined meetings and followed the Agile/Scrum process. \n- Using modern technologies at the running time: Kendo UI, moment, lodash. \nKey achievement: Learned many new things from new business scope in wealth management and Agile/Scrum \nprocess. \n \nSoftware Engineer \nNew Ocean Information System Co., Ltd - Onsite - Tan Binh - HCM\n \nSep 2014 - Dec 2018 \n- Joined a team to develop an application based on Qt to send and receive data on a big network. \n- Joined a team to develop applications using modern technologies at that time (AngularJS, Angular, Reactjs). \n- Helped to support other teams to review code. \n- Helped companies train for new comers.  \nKey achievement: Archived knowledge of web development and had some basic knowledge on Javascript.  \n \nEducation \nBachelor of Computer Science - Computer Vision \nUniversity of Science, Ho Chi Minh, Viet Nam. \n2010 - 2014 \nSkills \nWeb Frameworks/Libraries: Angular, \nAngularJS, ReactJS... \nWork Process: Agile/Scrum \n \nKey Projects \nBackbase - Backbase \nNov 2024 - Now \nWorking on the R&D department to implement the new AI-based ideas to collaborate the the main product of \ncompany. \nMainly Scope: Banking \nTechnologies: Angular, Bootstrap, Jest \nEnvironment: Webstorm, Github, Nx \nRole: Front-end Developer. \n \nStatrys - HCL \nSep 2022 - Nov 2024 \nBuilding the application for both Front users and admin user of a fintech company to allow user to make a money \ntransfer in different currencies. \nMainly Scope: FinTech \n\nTechnologies: Angular, ReactJS, TailwindCSS, Material, GraphQL, Unit testing using Jasmine/Karma,  \nEnvironment: VSC, Git, Chrome, Windows, Agile/Scrum \nRole: Front-end Developer. \n \nPW - HCL \nDec 2021 - Dec 2023 \nDevelop a DMS system for storing the document regarding to aerospace scope \nMainly Scope: Aerospace, DMS \nTechnologies: Angular 11-14, GoJS, ASP NET \nEnvironment: Webstorm, Git, Chrome, Windows, Agile/Scrum, Remote Desktop Connection \nRole: Front-end Developer. \n \nFinantix - Nashtech \nDec 2018 – Oct 2020 \nAn applicant for manage the orders/invoices/payments. Also, other bankers, or wealth managers can use to \nintroduce / demonstrate the plan to customer. \nMainly Scope: ODC – Finance, Banking, Insurance, Wealth management. \nTechnologies: Angularjs, Angular 7, Nodejs, IOS (Swift), Android (Java),  SOLID principles. \nEnvironment: Webstorm, Git, Chrome, IOS, Android, MacOS, Agile/Scrum. \nRole: Front-end Developer, Mobile App Developer (Minor) \n \nTrabble – chatbot \nFeb 2018 –Oct 2018 \nA project to build a chat-bot for tourism to be able to understand about the destination (famous places, restaurants, \nhotels) in Singapore \nTechnologies: HTML, CSS, Angular 5, ReactJS, Nativescript, SignalR, ASP Net core. Facebook API, Google Place API. \nAngular Material, Nodejs \nEnvironment: Webstorm, Git, Chrome, Angular Cli, Azure portal, Invision, Trello \nRole: Front-end and Back-end developer. \n \nDMS – IMS - AMS \nJan 2016 – Aug 2016 \nManage the documents which use Leaflet so display satellite data \nMainly Scope: Network Management \nTechnologies: HTML, CSS, jQuery, AngularJs 1.x, KendoUI, Leaflet,  SOLID principles. \nEnvironment: Webstorm, Git, Chrome, Webpack. \nRole: Front-end: Building UI, logic, Fixing bugs. \n \nSift Security \nMay 2015 – Jun 2016 \nA page for managing devices in a network as well as using machine learning for detecting anomaly connections via a \ngraphic instance. \nMainly Scope: Network Management \n\nTechnologies: HTML, CSS, D3js, jQuery, AngularJs 1.x, Angular UI (Bootstrap, Route), Lodash, Scala, Protractor, Karma, \nChaiJS, Sinon \nEnvironment: Webstorm, Git, Chrome, Grunt. \nRole: Front-end: Working in team to build UI, logic, binding data, writing unit test, end-to-end test. \n \nCobb and Coach Office \nOct 2014 \nThis page is a back-office project used to manage all the aspects of an oversea transport services company including \ncustomers management, quotations, orders, payrolls, etc. \nMainly Scope: Transport Management \nTechnologies: HTML, CSS, jQuery, AngularJs 1.3, Angular UI Bootstrap, Underscore, ASP.NET \nEnvironment: Visual Studio, Firefox, SVN, Git. \nRole: Develop front-end side (building UI, logic, data, fixing bugs) and back-end developer for fixing bugs and writing \nAPIs. \n \nThere are also some projects that work for short terms and are not listed in the CV. \n "
}